<<<<<<< HEAD
# 5. Напишите программу для запроса данных у пользователя с последующим выводом их на печать
name = input('Укажите свое имя сэр - ')
age = int(input('Сколько лет тебе дитя? - '))
city = input('В каком городе ты сейчас живешь? - ')
print()
print('Все корректно?')
=======
# 5. Напишите программу для запроса данных у пользователя с последующим выводом их на печать
name = input('Укажите свое имя сэр - ')
age = int(input('Сколько лет тебе дитя? - '))
city = input('В каком городе ты сейчас живешь? - ')
print()
print('Все корректно?')
>>>>>>> d6dde82cfa360c6ec55e039771f79543f82fa9d0
print('Ваше имя - {}\n Ваш возраст -  {}\n Вы проживаете в - {}'.format(name, age, city))